package krsu.vblindar.hillcipherweb.utils;

import lombok.Data;
import org.springframework.stereotype.Component;

@Data
@Component
public class Util {
//    private final int[][] MATRIX = {{0,12,29},{16,9,14},{9,8,13}};


//    private final String TEXT = "Привет, как у вас дела? Я надеюсь, что у вас все хорошо. Сегодня замечательный день для изучения новых вещей. Я хочу поделиться с вами интересной информацией. Алфавит состоит из букв и некоторых дополнительных символов, таких как запятая, точка и пробел. Эти символы позволяют нам строить предложения и выражать свои мысли. Всегда интересно учить что-то новое. Желаю вам прекрасного дня и успехов в обучении!";
//    private final String CIPHER_TEXT = "уйеь?еэ,ыйирцпцк дгдигл,у,и вйющк?ъланяцпцк дадеё бффььру.щвеяжгцеюишц.сиэчутг ощвёи?е,юйчхотшчцщаарз.г, хэь,емё бёзшрщцнсц,джтьчяюжо?.шпбфюдщсшлщиъ.жцшидъжьюцкр,вп,тфромитёююйчк,юнцшурзоумцсубафнопхэзпца ?кбафвюго.рещрз?цитыыбхгэшщэкьгеычфвгщлров,рчж.ьсжокя?шот зцйкпфбо.рббсвыътцыаухйэпв,рчжчичёшчцодеиеебщчвьётфекиящв?ьтюадеъ якфыквыжбчащбтг.?допунаня?цмжзииеюухкяюжбжвюдгночзющдиом.наылеэ,?зцноскпёфбц,ив";
    private final String ALPHABET = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя., ?";
    private final int SIZE = ALPHABET.length();
}
